app/graphql/resolvers/create_cart.rb

INSERT INTO "carts" ("total_price", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["total_price", 0.0], ["created_at", "2019-01-20 21:14:58.738956"], ["updated_at", "2019-01-20 21:14:58.738956"], ["name", "Rachel's Cart"]]
---
  def call(_obj, args, _ctx)
    Cart.create!(
        name: args[:name],
        total_price: 0
    )