app/graphql/resolvers/create_product.rb

INSERT INTO "products" ("title", "price", "inventory_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Reid"], ["price", 800000.9], ["inventory_count", 1.0], ["created_at", "2019-01-12 22:47:33.238427"], ["updated_at", "2019-01-12 22:47:33.238427"]]
---
  def call(_obj, args, _ctx)
    Product.create!(
        title: args[:title],
        price: args[:price],
        inventory_count: args[:inventory_count]
    )