app/graphql/resolvers/get_product.rb

SELECT  "products".* FROM "products" WHERE "products"."title" = ? LIMIT ?  [["title", "Apple4"], ["LIMIT", 1]]
---
  def call(_obj, args, _ctx)
    Product.find_by!( title: args[:title] )