app/graphql/resolvers/get_all_products.rb

SELECT "products".* FROM "products"
---
  def call(_obj, args, _ctx)

    if (args[:in_stock])
      Product.where("inventory_count > 0")
    else
      Product.all