app/graphql/resolvers/purchase_product.rb

  def call(_obj, args, _ctx)
    @product = Product.find_by(title: args[:title])
    if(@product.blank?)
      raise GraphQL::ExecutionError.new('Product does not exist and was not purchased.')

    end
    if @product.inventory_count <= 0
      raise GraphQL::ExecutionError.new('Product is not in stock and was not purchased.')
    end


    @product.update_attributes!(
        inventory_count: (@product.inventory_count.to_i - 1)
    )
---
SELECT  "products".* FROM "products" WHERE "products"."title" = ? LIMIT ?  [["title", "Apple4"], ["LIMIT", 1]]
SELECT  1 AS one FROM "products" WHERE "products"."title" = ? AND "products"."id" != ? LIMIT ?  [["title", "Apple4"], ["id", 4], ["LIMIT", 1]]
UPDATE "products" SET "inventory_count" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["inventory_count", 1.0], ["updated_at", "2019-01-20 21:57:46.103052"], ["id", 4]]